[
    "The Lego Batman Movie is a 2017 animated superhero comedy film produced by Warner Animation Group, DC Entertainment, RatPac-Dune Entertainment, Lego System A/S, Lin Pictures, Lord Miller Productions, and Vertigo Entertainment, and distributed by Warner Bros. Pictures. It was directed by Chris McKay (in his feature directorial debut) from a screenplay by Seth Grahame-Smith, Chris McKenna, Erik Sommers, Jared Stern, and John Whittington. Based on the characters from the DC Universe created by DC Comics and the Lego DC Super Heroes' Batman toy line, the film is a collaboration between production houses from the United States, Australia, and Denmark, the first spin-off in The Lego Movie franchise and the second installment overall. The film features Will Arnett reprising his role as Batman from The Lego Movie alongside Zach Galifianakis, Michael Cera, Rosario Dawson, and Ralph Fiennes. The story follows the eponymous character (Arnett) as he attempts to overcome his greatest fear while saving Gotham City from the Joker's (Galifianakis) latest scheme.",
    "A camel (from Latin: camelus and Greek: κάμηλος (kamēlos) from Ancient Semitic: gāmāl) is an even-toed ungulate in the genus Camelus that bears distinctive fatty deposits known as \"humps\" on its back. Camels have long been domesticated and, as livestock, they provide food (camel milk and meat) and textiles (fiber and felt from camel hair). Camels are working animals especially suited to their desert habitat and are a vital means of transport for passengers and cargo. There are three surviving species of camel. The one-humped dromedary makes up 94% of the world's camel population, and the two-humped Bactrian camel makes up 6%. The wild Bactrian camel is a distinct species that is not ancestral to the domestic Bactrian camel, and is now critically endangered, with fewer than 1,000 individuals.\n\nThe word camel is also used informally in a wider sense, where the more correct term is \"camelid\", to include all seven species of the family Camelidae: the true camels (the above three species), along with the \"New World\" camelids: the llama, the alpaca, the guanaco, and the vicuña, which belong to the separate tribe Lamini.[9] Camelids originated in North America during the Eocene, with the ancestor of modern camels, Paracamelus, migrating across the Bering land bridge into Asia during the late Miocene, around 6 million years ago.",
    "Carbon is the foundation of all life on Earth, required to form complex molecules like proteins and DNA. This element is also found in our atmosphere in the form of carbon dioxide (CO2). Carbon helps to regulate the Earth’s temperature, makes all life possible, is a key ingredient in the food that sustains us, and provides a major source of the energy to fuel our global economy. The carbon cycle describes the process in which carbon atoms continually travel from the atmosphere to the Earth and then back into the atmosphere. Since our planet and its atmosphere form a closed environment, the amount of carbon in this system does not change. Where the carbon is located — in the atmosphere or on Earth — is constantly in flux. On Earth, most carbon is stored in rocks and sediments, while the rest is located in the ocean, atmosphere, and in living organisms. These are the reservoirs, or sinks, through which carbon cycles. Carbon is released back into the atmosphere when organisms die, volcanoes erupt, fires blaze, fossil fuels are burned, and through a variety of other mechanisms.\n\nIn the case of the ocean, carbon is continually exchanged between the ocean’s surface waters and the atmosphere, or is stored for long periods of time in the ocean depths.\n\nHumans play a major role in the carbon cycle through activities such as the burning of fossil fuels or land development. As a result, the amount of carbon dioxide in the atmosphere is rapidly rising; it is already considerably greater than at any time in the last 3.6 million years."
]